app/Models/IntegrationSettingsModel.php

    public function getLastFetchTime()
    {
        return $this->first()['last_fetch_time'] ?? null;
---
SELECT *
FROM `integration_settings`
 LIMIT 1

    public function updateLastFetchTime($time)
    {
        return $this->update(1, ['last_fetch_time' => $time]);
---
UPDATE `integration_settings` SET `last_fetch_time` = '2026-02-21 07:56:11'
WHERE `integration_settings`.`id` IN (1)